In [1]:
import pandas as pd

In [2]:
names = ['Olga', 'Andrew', 'Brian', 'Telulah', 'Nicole', 'Tilda']
ages = [29, 21, 45, 23, 39, 46]
married = [False, True, True, True, False, True]

In [5]:
df = pd.DataFrame({'name':names, 'age':ages, 'maried':married})
df

      name  age  maried
0     Olga   29   False
1   Andrew   21    True
2    Brian   45    True
3  Telulah   23    True
4   Nicole   39   False
5    Tilda   46    True

In [9]:
new_names = names + ['Rayan']
print(f'len of new_names:{len(new_names)}; len of ages:{len(ages)}; len of married:{len(married)}')

len of new_names:7; len of ages:6; len of married:6

In [7]:
# ValueError: All arrays must be of the same length
pd.DataFrame({'name':new_names, 'age':ages, 'married':married})

ValueError: All arrays must be of the same length

In [12]:
tuple_names = tuple(names)
tuple_ages = tuple(ages)
tuple_marrided = tuple(married)

In [13]:
tuple_names

('Olga', 'Andrew', 'Brian', 'Telulah', 'Nicole', 'Tilda')

In [14]:
tuple_ages

(29, 21, 45, 23, 39, 46)

In [15]:
tuple_marrided

(False, True, True, True, False, True)

In [16]:
pd.DataFrame({'name':tuple_names, 'age':tuple_ages, 'married': tuple_marrided})

      name  age  married
0     Olga   29    False
1   Andrew   21     True
2    Brian   45     True
3  Telulah   23     True
4   Nicole   39    False
5    Tilda   46     True

In [17]:
df

      name  age  maried
0     Olga   29   False
1   Andrew   21    True
2    Brian   45    True
3  Telulah   23    True
4   Nicole   39   False
5    Tilda   46    True

# 2 - dict of series

In [20]:
series_names = pd.Series(names)
series_ages = pd.Series(ages)
series_married = pd.Series(married)

In [24]:
pd.DataFrame({'Name':series_names,'Age':series_ages,'Married':series_married})

      Name  Age  Married
0     Olga   29    False
1   Andrew   21     True
2    Brian   45     True
3  Telulah   23     True
4   Nicole   39    False
5    Tilda   46     True

In [26]:
pd.DataFrame({'names':['Olga','Andrew']})

    names
0    Olga
1  Andrew

In [28]:
pd.DataFrame({'names':{0:'Olga',1:'Andrew'}})

    names
0    Olga
1  Andrew

# The enumerate function

In [29]:
list(enumerate(names))

[(0, 'Olga'),
 (1, 'Andrew'),
 (2, 'Brian'),
 (3, 'Telulah'),
 (4, 'Nicole'),
 (5, 'Tilda')]

In [30]:
dict(enumerate(names))

{0: 'Olga', 1: 'Andrew', 2: 'Brian', 3: 'Telulah', 4: 'Nicole', 5: 'Tilda'}

In [31]:
dict_names = {k:v for k,v in enumerate(names)}

In [32]:
easy_dic_names = dict(enumerate(names))

In [33]:
dict_names == easy_dic_names

True

In [34]:
dict_ages  = {k:v for k,v in enumerate(ages)}
dict_married = {k:v for k,v in enumerate(married)}

In [37]:
easy_dic_ages = dict(enumerate(ages))
easy_dic_married = dict(enumerate(married))

In [38]:
easy_dic_ages == dict_ages

True

In [39]:
easy_dic_married == dict_married

True

In [40]:
pd.DataFrame({'name':dict_names, 'Age':easy_dic_ages, 'Married':easy_dic_married})

      name  Age  Married
0     Olga   29    False
1   Andrew   21     True
2    Brian   45     True
3  Telulah   23     True
4   Nicole   39    False
5    Tilda   46     True

In [41]:
def convert_list_to_dict(list_to_convert):
    return {k:v for k,v in enumerate(list_to_convert)}

In [49]:
dict_fuc_call_names = convert_list_to_dict(names)
dict_fuc_call_ages = convert_list_to_dict(ages)
dict_fuc_call_married = convert_list_to_dict(married)
print(f'Names:{easy_dic_names == dict_names == dict_fuc_call_names}; '
        f'Ages:{easy_dic_ages == dict_ages == dict_fuc_call_ages}; '
        f'Married:{easy_dic_married == dict_married == dict_fuc_call_married}')

Names:True; Ages:True; Married:True

In [50]:
pd.DataFrame({'Name':dict_fuc_call_names, 'Ages':dict_fuc_call_ages, 'Married':dict_fuc_call_married})

      Name  Ages  Married
0     Olga    29    False
1   Andrew    21     True
2    Brian    45     True
3  Telulah    23     True
4   Nicole    39    False
5    Tilda    46     True

# 4 - List of dict

In [52]:
pd.DataFrame([{'Name':'Olga', 'Age': 29, 'Married': False}])

   Name  Age  Married
0  Olga   29    False

In [53]:
list(zip(names,ages, married))

[('Olga', 29, False),
 ('Andrew', 21, True),
 ('Brian', 45, True),
 ('Telulah', 23, True),
 ('Nicole', 39, False),
 ('Tilda', 46, True)]

In [57]:
row_wise = [{'Name':name, 'Age':ages, 'Married':married} for name, ages, married in zip(names, ages, married)]
row_wise

[{'Name': 'Olga', 'Age': 29, 'Married': False},
 {'Name': 'Andrew', 'Age': 21, 'Married': True},
 {'Name': 'Brian', 'Age': 45, 'Married': True},
 {'Name': 'Telulah', 'Age': 23, 'Married': True},
 {'Name': 'Nicole', 'Age': 39, 'Married': False},
 {'Name': 'Tilda', 'Age': 46, 'Married': True}]

In [58]:
pd.DataFrame(row_wise)

      Name  Age  Married
0     Olga   29    False
1   Andrew   21     True
2    Brian   45     True
3  Telulah   23     True
4   Nicole   39    False
5    Tilda   46     True